In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
one=['one','1','one1']
a=['A','a','Aa']

In [4]:
df1= pd.DataFrame({'one':one,'a':a})

In [5]:
df1

    one   a
0   one   A
1     1   a
2  one1  Aa

In [8]:
df1=df1[['one','a']]

In [12]:
a=['A','a','Aa']
b=['B','b','Bb']

In [14]:
df2= pd.DataFrame({'a':a,'b':b})

In [15]:
df2

    a   b
0   A   B
1   a   b
2  Aa  Bb

In [16]:
df2=df2[['a','b']]
df2

    a   b
0   A   B
1   a   b
2  Aa  Bb

In [22]:
df3=df1.merge(df2,on='a',how='outer')
df3

    one   a   b
0   one   A   B
1     1   a   b
2  one1  Aa  Bb